tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Freely available high-quality data compressor
brew "bzip2"
# GNU compiler collection
brew "gcc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Menu bar icon organizer
cask "bartender"
# App to build and share containerized applications and microservices
cask "docker"
# Terminal/ssh/serial port/sftp client
cask "electerm"
# Web browser
cask "firefox"
# Download accelerator and organizer
cask "free-download-manager"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# iPhone management application
cask "imazing"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Home media player
cask "plex"
# Snip or pin screenshots
cask "snipaste"
cask "spark"
# Remote desktop control and monitoring tool
cask "sunloginclient"
# Messaging app with a focus on speed and security
cask "telegram"
cask "tencent-lemon"
# Terminal for a more modern age
cask "terminus"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Note-taking application that knows programmers and Markdown better
cask "vnote"
# Free messaging and calling application
cask "wechat"
# Network protocol analyzer
cask "wireshark"
mas "AutoSwitchInput", id: 1470350547
mas "Bitwarden", id: 1352778147
mas "Evernote Web Clipper", id: 1481669779
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "WireGuard", id: 1451685025
