tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-versions"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "knqyf263/pet"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Light UNIX download accelerator
brew "axel"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Freely available high-quality data compressor
brew "bzip2"
# GNU compiler collection
brew "gcc"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Git repository summary on your terminal
brew "onefetch"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# SMART hard drive monitoring
brew "smartmontools"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Simple command-line snippet manager
brew "knqyf263/pet/pet"
# Stand alone ad blocker
cask "adguard"
# GUI based on Clash
cask "clash-for-windows"
# Rule-based custom proxy with GUI based on clash
cask "clashx-pro"
# Terminal/ssh/serial port/sftp client
cask "electerm"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# iPhone management application
cask "imazing"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Home media player
cask "plex"
# Snip or pin screenshots
cask "snipaste"
# Terminal for a more modern age
cask "terminus"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Code editor
cask "visual-studio-code-insiders"
# Note-taking application that knows programmers and Markdown better
cask "vnote"
# Free messaging and calling application
cask "wechat"
mas "Bitwarden", id: 1352778147
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "WeChat", id: 836500024
